DesBackEnd/app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("cnpj", "razao_social", "num_funcionarios", "processo_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["cnpj", "0909"], ["razao_social", "Teste"], ["num_funcionarios", 2], ["processo_id", 1], ["status", 1], ["created_at", "2018-03-27 01:01:10.499779"], ["updated_at", "2018-03-27 01:01:10.499779"]]
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

UPDATE "clientes" SET "cnpj" = ?, "razao_social" = ?, "num_funcionarios" = ?, "processo_id" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["cnpj", "123456789"], ["razao_social", "FIGUEREDO BARBOSA"], ["num_funcionarios", 900], ["processo_id", 2], ["updated_at", "2018-03-29 19:06:02.954794"], ["id", 24]]
---
  def update
    respond_to do |format|
      if @cliente.update(cliente_params)