DesBackEnd/app/controllers/processos_controller.rb

SELECT "processos".* FROM "processos"
---
  def index
    @processos = Processo.all

INSERT INTO "processos" ("nome", "descricao", "situacao", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Teste"], ["descricao", "Teste"], ["situacao", "Pendente"], ["status", 1], ["created_at", "2018-03-27 01:00:47.740088"], ["updated_at", "2018-03-27 01:00:47.740088"]]
---
  def create
    @processo = Processo.new(processo_params)

    respond_to do |format|
      if @processo.save

UPDATE "processos" SET "nome" = ?, "descricao" = ?, "situacao" = ?, "updated_at" = ? WHERE "processos"."id" = ?  [["nome", "Maluco do gás"], ["descricao", "Carro com musica chata"], ["situacao", "Aprovado"], ["updated_at", "2018-03-29 19:03:19.826462"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @processo.update(processo_params)

SELECT  "processos".* FROM "processos" WHERE "processos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_processo
    @processo = Processo.find(params[:id])