DesBackEnd/app/controllers/registros_controller.rb

  def index
    @clientes = Cliente.all
    @processos = Processo.all
---
SELECT "clientes".* FROM "clientes"
SELECT "processos".* FROM "processos"